# Temperature Rating Get Temperature Rating Method

Source: https://www.revitapidocs.com/2026/7af3e129-c1aa-92f0-9584-7bb9475b6df3.htm

---

| Temperature Rating Get Temperature Rating Method |
| --- |

Gets the Conductor Temperature Rating data by given Conductor Temperature Rating id.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static TemperatureRating GetTemperatureRating(
	Document document,
	ElementId temperatureRatingId
)
```

```
Public Shared Function GetTemperatureRating (
	document As Document,
	temperatureRatingId As ElementId
) As TemperatureRating
```

```
public:
static TemperatureRating^ GetTemperatureRating(
	Document^ document,
	ElementId^ temperatureRatingId
)
```

```
static member GetTemperatureRating :
        document : Document *
        temperatureRatingId : ElementId -> TemperatureRating
```

#### Parameters

document Document
:   The document.

temperatureRatingId ElementId
:   The Conductor Temperature Rating id.

#### Return Value

TemperatureRating
The Conductor Temperature Rating data. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document.  \-or\-  The id is not a Conductor Temperature Rating id. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |

See Also

#### Reference

TemperatureRating Class Autodesk.Revit.DB.Electrical Namespace